scales = {
    0: 'Трудолюбивость',
    1: 'Интеллектуальность',
    2: 'Навыки',
    3: 'Целеустремлённость',
}

survey = [
    {
        'q': 'Как бы ты решил пересечь длинную и широкую реку?',
        'a': {
            'Переплыть': [10, 3, 5, 8],
            'Найти ближайший мост': [5, 10, 5, 3],
            'Сделать плот': [3, 8, 10, 3],
            'Уйти': [0, 10, 0, 0],
            'Позвать на помощь': [0, 10, 2, 5],
        }
    },
    {
        'q': 'Вы едите по навигатору, но пропала связь и он перестал показывать направление. Что будете делать?',
        'a': {
            'Спрошу дорогу у местных': [3, 10, 3, 5],
            'Буду ориентироваться по знакам': [5, 0, 0, 7],
            'Доеду до места, где есть связь': [7, 5, 0, 4],
            'Развернусь и поеду обратно': [0, 5, 0, 0],
        }
    },
    {
        'q': 'Вы взяли много продуктов в магазине, но на всё не хватило денег. Что будете делать?',
        'a': {
            'Отказаться от дорогих продуктов': [1, 7, 4, 5],
            'Уйти': [0, 5, 0, 0],
            'Сбегать домой за деньгами': [10, 0, 2, 9],
            'Договориться с кассиром': [5, 8, 10, 5],
        }
    },
    {
        'q': 'Что бы ты предпочёл: подняться на гору или отдохнуть на пляже?',
        'a': {
            'Сделать и то, и другое': [7, 3, 3, 7],
            'Отдохнуть на пляже': [0, 6, 0, 0],
            'Покорить гору': [10, 3, 6, 8],
            'Ничего из этого': [0, 1, 0, 0],
        }
    },
    {
        'q': 'Ты приехал домой и забыл ключи. Твои действия?',
        'a': {
            'Поеду обратно за ключами': [8, 3, 0, 8],
            'Открою замок без ключа': [5, 7, 10, 5],
            'Попрошу подвезти ключи': [2, 10, 6, 3],
            'Останусь у двери': [10, 0, 0, 10],
        }
    },
]
